{
  "architectures": [
    "DeiTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 192,
  "id2label": {
    "0": "picture",
    "1": "document"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 768,
  "label2id": {
    "document": 1,
    "picture": 0
  },
  "layer_norm_eps": 1e-12,
  "model_type": "deit",
  "num_attention_heads": 3,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "pooler_act": "tanh",
  "pooler_output_size": 192,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "transformers_version": "4.57.6"
}
